papers/automatica-16-secureest.html
---
comments: true
layout: page
title: Convex Optimization Based State Estimation against Sparse Integrity Attacks
---
<hr />
<p>
<b>Duo Han, Yilin Mo and Lihua Xie</b>
</p>

<p>
<i>Automatica</i>, In Review
</p>

<p>
Link to the <a href="../../../public/papers/automatica16.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Fautomatica16.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-org1feb8ef" class="outline-2">
<h2 id="org1feb8ef">Abstract</h2>
<div class="outline-text-2" id="text-org1feb8ef">
<p>
We consider the problem of resilient state estimation in the presence of integrity attacks. There are \(m\) sensors monitoring the state and \(p\) of them are under attack. The sensory data collected by the compromised sensors can be manipulated arbitrarily by the attacker. The classical estimators such as the least squares estimator may not provide a reliable estimate under the so-called $(p,m)$-sparse attack. In this work, we are not restricting our efforts in studying whether any specific estimator is resilient to the attack or not, but instead we aim to present some generic sufficient and necessary conditions for resilience by considering a general class of convex optimization based estimators. The sufficient and necessary conditions are shown to be tight, with a trivial gap. We further specialize our result to scalar sensor measurements case. Experimental results tested on the IEEE 14-bus test system validate the theoretical analysis.
</p>
</div>
</div>
